# -*- coding: utf-8 -*-
"""
Правила русской генеративной грамматики для формирования ответов чат-бота.
"""

from __future__ import division
from __future__ import print_function


def compile_grammar(grammar, max_len):
    grammar.set_max_rule_length(max_len)

    # Предлоги всегда подмешиваем в затравочный wordbag, так как делать с ними
    # отдельные правила нельзя из-за экспоненциального взрыва количества вариантов.
    grammar.add_word(u'с', u'ПРЕДЛОГ')
    grammar.add_word(u'на', u'ПРЕДЛОГ')
    grammar.add_word(u'в', u'ПРЕДЛОГ')
    grammar.add_word(u'за', u'ПРЕДЛОГ')
    grammar.add_word(u'про', u'ПРЕДЛОГ')
    grammar.add_word(u'под', u'ПРЕДЛОГ')
    grammar.add_word(u'о', u'ПРЕДЛОГ')
    grammar.add_word(u'об', u'ПРЕДЛОГ')

    grammar.add_word(u'с', u'ПРЕДЛОГ')
    grammar.add_word(u'за', u'ПРЕДЛОГ')
    grammar.add_word(u'над', u'ПРЕДЛОГ')
    grammar.add_word(u'под', u'ПРЕДЛОГ')

    grammar.add_word(u'из', u'ПРЕДЛОГ')
    grammar.add_word(u'до', u'ПРЕДЛОГ')
    grammar.add_word(u'после', u'ПРЕДЛОГ')
    grammar.add_word(u'вместо', u'ПРЕДЛОГ')
    grammar.add_word(u'внутри', u'ПРЕДЛОГ')
    grammar.add_word(u'вдали от', u'ПРЕДЛОГ')
    grammar.add_word(u'недалеко от', u'ПРЕДЛОГ')
    grammar.add_word(u'из-за', u'ПРЕДЛОГ')
    grammar.add_word(u'у', u'ПРЕДЛОГ')
    grammar.add_word(u'около', u'ПРЕДЛОГ')

    grammar.add_word(u'на', u'ПРЕДЛОГ')
    grammar.add_word(u'в', u'ПРЕДЛОГ')
    grammar.add_word(u'о', u'ПРЕДЛОГ')
    grammar.add_word(u'об', u'ПРЕДЛОГ')

    grammar.add_word(u'к', u'ПРЕДЛОГ')
    grammar.add_word(u'по', u'ПРЕДЛОГ')




    # правое родительное дополнение для существительных
    grammar.add_macro(u'род_доп = [сущ,род]')
    grammar.add_macro(u'род_доп = [сущ,род] [сущ,род]')  # правила генерации ответа
    grammar.add_macro(u'род_доп = [прил,муж,ед,род] [сущ,муж,ед,род]')
    grammar.add_macro(u'род_доп = [прил,жен,ед,род] [сущ,жен,ед,род]')
    grammar.add_macro(u'род_доп = [прил,ср,ед,род] [сущ,ср,ед,род]')
    grammar.add_macro(u'род_доп = [прил,мн,род] [сущ,мн,род]')

    grammar.add_macro(u'род_доп = [прил,муж,ед,род] [сущ,муж,ед,род] [сущ,род]')
    grammar.add_macro(u'род_доп = [прил,жен,ед,род] [сущ,жен,ед,род] [сущ,род]')
    grammar.add_macro(u'род_доп = [прил,ср,ед,род] [сущ,ср,ед,род] [сущ,род]')
    grammar.add_macro(u'род_доп = [прил,мн,род] [сущ,мн,род] [сущ,род]')

    grammar.add_macro(u'род_доп = [нареч,модиф_прил] [прил,муж,ед,род] [сущ,муж,ед,род]')
    grammar.add_macro(u'род_доп = [нареч,модиф_прил] [прил,жен,ед,род] [сущ,жен,ед,род]')
    grammar.add_macro(u'род_доп = [нареч,модиф_прил] [прил,ср,ед,род] [сущ,ср,ед,род]')
    grammar.add_macro(u'род_доп = [нареч,модиф_прил] [прил,мн,род] [сущ,мн,род]')

    # =====================================================================================
    grammar.add_macro(u'объект,вин0 = [сущ,вин]')

    grammar.add_macro(u'объект,вин0 = [прил,муж,ед,вин,одуш] [сущ,муж,ед,вин,одуш]')  # большого пса
    grammar.add_macro(u'объект,вин0 = [прил,муж,ед,вин,одуш] [прил,муж,ед,вин,одуш] [сущ,муж,ед,вин,одуш]')  # большого лохматого пса
    grammar.add_macro(u'объект,вин0 = [прил,муж,ед,вин,неодуш] [сущ,муж,ед,вин,неодуш]')  # городской зоопарк
    grammar.add_macro(u'объект,вин0 = [прил,муж,ед,вин,неодуш] [прил,муж,ед,вин,неодуш] [сущ,муж,ед,вин,неодуш]')  # главный городской зоопарк
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,муж,ед,вин,одуш] [сущ,муж,ед,вин,одуш]')
    grammar.add_macro(u'объект,вин0 = [прил,жен,ед,вин] [сущ,жен,ед,вин]')  # пушистую кошку
    grammar.add_macro(u'объект,вин0 = [прил,жен,ед,вин] [прил,жен,ед,вин] [сущ,жен,ед,вин]')  # пушистую сиамскую кошку
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,жен,ед,вин] [сущ,жен,ед,вин]')
    grammar.add_macro(u'объект,вин0 = [прил,ср,ед,вин] [сущ,ср,ед,вин]')  # горячее питье
    grammar.add_macro(u'объект,вин0 = [прил,ср,ед,вин] [прил,ср,ед,вин] [сущ,ср,ед,вин]')  # горячее кислое питье
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,ср,ед,вин] [сущ,ср,ед,вин]')

    grammar.add_macro(u'объект,вин0 = [прил,муж,мн,вин,одуш] [сущ,ср,мн,вин,одуш]')
    grammar.add_macro(u'объект,вин0 = [прил,муж,мн,вин,неодуш] [сущ,ср,мн,вин,неодуш]')
    grammar.add_macro(u'объект,вин0 = [прил,мн,вин,неодуш] [сущ,жен,мн,вин]')
    grammar.add_macro(u'объект,вин0 = [прил,мн,вин,неодуш] [сущ,ср,мн,вин]')
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,муж,мн,вин,одуш] [сущ,ср,мн,вин,одуш]')
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,муж,мн,вин,неодуш] [сущ,ср,мн,вин,неодуш]')
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,мн,вин,неодуш] [сущ,жен,мн,вин]')
    grammar.add_macro(u'объект,вин0 = [нареч,модиф_прил] [прил,мн,вин,неодуш] [сущ,ср,мн,вин]')

    grammar.add_macro(u'объект,вин = объект,вин0')
    grammar.add_macro(u'объект,вин = объект,вин0 род_доп')
    grammar.add_macro(u'объект,вин = [сущ,вин] [союз] [сущ,вин]') # чепчик и платье

    # =====================================================================================

    grammar.add_macro(u'объект,дат0 = [сущ,дат]')

    grammar.add_macro(u'объект,дат0 = [прил,муж,ед,дат] [сущ,муж,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [прил,жен,ед,дат] [сущ,жен,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [прил,ср,ед,дат] [сущ,ср,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [прил,мн,дат] [сущ,мн,дат]')

    grammar.add_macro(u'объект,дат0 = [прил,муж,ед,дат] [прил,муж,ед,дат] [сущ,муж,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [прил,жен,ед,дат] [прил,жен,ед,дат] [сущ,жен,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [прил,ср,ед,дат] [прил,ср,ед,дат] [сущ,ср,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [прил,мн,дат] [прил,мн,дат] [сущ,мн,дат]')

    grammar.add_macro(u'объект,дат0 = [нареч,модиф_прил] [прил,муж,ед,дат] [сущ,муж,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [нареч,модиф_прил] [прил,жен,ед,дат] [сущ,жен,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [нареч,модиф_прил] [прил,ср,ед,дат] [сущ,ср,ед,дат]')
    grammar.add_macro(u'объект,дат0 = [нареч,модиф_прил] [прил,мн,дат] [сущ,мн,дат]')

    grammar.add_macro(u'объект,дат = объект,дат0')
    grammar.add_macro(u'объект,дат = объект,дат0 род_доп')

    # =====================================================================================

    grammar.add_macro(u'объект,тв0 = [сущ,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,муж,ед,тв] [сущ,муж,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,жен,ед,тв] [сущ,жен,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,ср,ед,тв] [сущ,ср,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,мн,тв] [сущ,мн,тв]')

    grammar.add_macro(u'объект,тв0 = [прил,муж,ед,тв] [прил,муж,ед,тв] [сущ,муж,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,жен,ед,тв] [прил,жен,ед,тв] [сущ,жен,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,ср,ед,тв] [прил,ср,ед,тв] [сущ,ср,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [прил,мн,тв] [прил,мн,тв] [сущ,мн,тв]')

    grammar.add_macro(u'объект,тв0 = [нареч,модиф_прил] [прил,муж,ед,тв] [сущ,муж,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [нареч,модиф_прил] [прил,жен,ед,тв] [сущ,жен,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [нареч,модиф_прил] [прил,ср,ед,тв] [сущ,ср,ед,тв]')
    grammar.add_macro(u'объект,тв0 = [нареч,модиф_прил] [прил,мн,тв] [сущ,мн,тв]')

    grammar.add_macro(u'объект,тв = объект,тв0')
    grammar.add_macro(u'объект,тв = объект,тв0 род_доп')

    # =====================================================================================

    grammar.add_macro(u'объект,род0 = [сущ,род]')
    grammar.add_macro(u'объект,род0 = [прил,муж,ед,род] [сущ,муж,ед,род]')
    grammar.add_macro(u'объект,род0 = [прил,жен,ед,род] [сущ,жен,ед,род]')
    grammar.add_macro(u'объект,род0 = [прил,ср,ед,род] [сущ,ср,ед,род]')
    grammar.add_macro(u'объект,род0 = [прил,мн,род] [сущ,мн,род]')

    grammar.add_macro(u'объект,род0 = [прил,муж,ед,род] [прил,муж,ед,род] [сущ,муж,ед,род]')
    grammar.add_macro(u'объект,род0 = [прил,жен,ед,род] [прил,жен,ед,род] [сущ,жен,ед,род]')
    grammar.add_macro(u'объект,род0 = [прил,ср,ед,род] [прил,ср,ед,род] [сущ,ср,ед,род]')
    grammar.add_macro(u'объект,род0 = [прил,мн,род] [прил,мн,род] [сущ,мн,род]')

    grammar.add_macro(u'объект,род0 = [нареч,модиф_прил] [прил,муж,ед,род] [сущ,муж,ед,род]')
    grammar.add_macro(u'объект,род0 = [нареч,модиф_прил] [прил,жен,ед,род] [сущ,жен,ед,род]')
    grammar.add_macro(u'объект,род0 = [нареч,модиф_прил] [прил,ср,ед,род] [сущ,ср,ед,род]')
    grammar.add_macro(u'объект,род0 = [нареч,модиф_прил] [прил,мн,род] [сущ,мн,род]')

    grammar.add_macro(u'объект,род = объект,род0')
    grammar.add_macro(u'объект,род = объект,род0 [сущ,род]')
    grammar.add_macro(u'объект,род = [сущ,род] [союз] [сущ,род]')

    # =====================================================================================

    grammar.add_macro(u'объект,предл0 = [сущ,предл]')

    grammar.add_macro(u'объект,предл0 = [прил,муж,ед,предл] [сущ,муж,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [прил,жен,ед,предл] [сущ,жен,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [прил,ср,ед,предл] [сущ,ср,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [прил,мн,предл] [сущ,мн,предл]')

    grammar.add_macro(u'объект,предл0 = [прил,муж,ед,предл] [прил,муж,ед,предл] [сущ,муж,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [прил,жен,ед,предл] [прил,жен,ед,предл] [сущ,жен,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [прил,ср,ед,предл] [прил,ср,ед,предл] [сущ,ср,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [прил,мн,предл] [прил,мн,предл] [сущ,мн,предл]')

    grammar.add_macro(u'объект,предл0 = [нареч,модиф_прил] [прил,муж,ед,предл] [сущ,муж,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [нареч,модиф_прил] [прил,жен,ед,предл] [сущ,жен,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [нареч,модиф_прил] [прил,ср,ед,предл] [сущ,ср,ед,предл]')
    grammar.add_macro(u'объект,предл0 = [нареч,модиф_прил] [прил,мн,предл] [сущ,мн,предл]')

    grammar.add_macro(u'объект,предл = объект,предл0')
    grammar.add_macro(u'объект,предл = объект,предл0 род_доп')

    # =====================================================================================

    # grammar.add_macro(u'предлог,вин = с')
    # grammar.add_macro(u'предлог,вин = на')
    # grammar.add_macro(u'предлог,вин = в')
    # grammar.add_macro(u'предлог,вин = за')
    # grammar.add_macro(u'предлог,вин = про')
    # grammar.add_macro(u'предлог,вин = под')
    # grammar.add_macro(u'предлог,вин = о')
    # grammar.add_macro(u'предлог,вин = об')
    #
    # grammar.add_macro(u'предлог,тв = с')
    # grammar.add_macro(u'предлог,тв = за')
    # grammar.add_macro(u'предлог,тв = над')
    # grammar.add_macro(u'предлог,тв = под')
    #
    # grammar.add_macro(u'предлог,род = из')
    # grammar.add_macro(u'предлог,род = до')
    # grammar.add_macro(u'предлог,род = после')
    # grammar.add_macro(u'предлог,род = вместо')
    # grammar.add_macro(u'предлог,род = внутри')
    # grammar.add_macro(u'предлог,род = вдали от')
    # grammar.add_macro(u'предлог,род = недалеко от')
    # grammar.add_macro(u'предлог,род = из-за')
    # grammar.add_macro(u'предлог,род = у')
    # grammar.add_macro(u'предлог,род = около')
    #
    # grammar.add_macro(u'предлог,предл = на')
    # grammar.add_macro(u'предлог,предл = в')
    # grammar.add_macro(u'предлог,предл = о')
    # grammar.add_macro(u'предлог,предл = об')
    #
    # grammar.add_macro(u'предлог,дат = к')
    # grammar.add_macro(u'предлог,дат = по')
    #
    # grammar.add_macro(u'предл_доп = предлог,тв объект,тв')  # с сестрой
    # grammar.add_macro(u'предл_доп = предлог,предл объект,предл')  # на велосипеде
    # grammar.add_macro(u'предл_доп = предлог,вин объект,вин')  # на стул
    # grammar.add_macro(u'предл_доп = предлог,дат объект,дат')  # к маме
    # grammar.add_macro(u'предл_доп = предлог,род объект,род')  # из письма

    grammar.add_macro(u'предл_доп = [предлог,тв] объект,тв')
    grammar.add_macro(u'предл_доп = [предлог,предл] объект,предл')
    grammar.add_macro(u'предл_доп = [предлог,вин] объект,вин')
    grammar.add_macro(u'предл_доп = [предлог,дат] объект,дат')
    grammar.add_macro(u'предл_доп = [предлог,род] объект,род')

    grammar.add_macro(u'предл_доп = [предлог,предл] [num_word]')  # в 1919


    # =====================================================================================

    grammar.add_macro(u'подлежащ0,ед = [сущ,им,ед,одуш] [сущ,им,ед,одуш]') # дядя федор
    grammar.add_macro(u'подлежащ0,ед = [сущ,им,ед]')
    grammar.add_macro(u'подлежащ0,ед = [прил,им,ед,муж,~кр] [сущ,им,ед,муж]')
    grammar.add_macro(u'подлежащ0,ед = [прил,им,ед,жен,~кр] [сущ,им,ед,жен]')
    grammar.add_macro(u'подлежащ0,ед = [прил,им,ед,ср,~кр] [сущ,им,ед,ср]')
    grammar.add_macro(u'подлежащ0,ед = [нареч,модиф_прил] [прил,им,ед,муж,~кр] [сущ,им,ед,муж]')
    grammar.add_macro(u'подлежащ0,ед = [нареч,модиф_прил] [прил,им,ед,жен,~кр] [сущ,им,ед,жен]')
    grammar.add_macro(u'подлежащ0,ед = [нареч,модиф_прил] [прил,им,ед,ср,~кр] [сущ,им,ед,ср]')

    grammar.add_macro(u'подлежащ1,ед = подлежащ0,ед')
    grammar.add_macro(u'подлежащ1,ед = подлежащ0,ед род_доп')
    grammar.add_macro(u'подлежащ1,ед = подлежащ0,ед предл_доп')

    grammar.add_macro(u'подлежащ,ед = 1 подлежащ1,ед')

    grammar.add_macro(u'подлежащ,ед = подлежащ1,ед')

    grammar.add_macro(u'подлежащ0,мн = [сущ,им,мн]')
    grammar.add_macro(u'подлежащ0,мн = [прил,им,мн,~кр] [сущ,им,мн]')
    grammar.add_macro(u'подлежащ0,мн = [нареч,модиф_прил] [прил,им,мн,~кр] [сущ,им,мн]')
    grammar.add_macro(u'подлежащ0,мн = [числит] [прил,род,мн,~кр] [сущ,род]')  # двое здоровенных шахтеров
    grammar.add_macro(u'подлежащ0,мн = [числит] [сущ,род]')  # три духа


    grammar.add_macro(u'подлежащ1,мн = подлежащ0,мн')
    grammar.add_macro(u'подлежащ1,мн = подлежащ0,мн род_доп')
    grammar.add_macro(u'подлежащ1,мн = подлежащ0,мн предл_доп')

    grammar.add_macro(u'число_2 = {2|3|4}')
    grammar.add_macro(u'число_5 = {5|6|7|8|9|10}')

    # конструкции со счетными наречиями:
    # несколько минут
    # Немного винограда
    grammar.add_macro(u'подлежащ,ед = [нареч,модиф_сущ] [сущ,род]')

    grammar.add_macro(u'подлежащ,мн = число_2 [сущ,ед,род]')  # 3 кошки
    grammar.add_macro(u'подлежащ,мн = число_5 [сущ,мн,род]')  # 5 кошек
    grammar.add_macro(u'подлежащ,мн = подлежащ1,мн')

    grammar.add_macro(u'подлежащ = подлежащ,ед')
    grammar.add_macro(u'подлежащ = подлежащ,мн')

    grammar.add_macro(u'подлежащ = [сущ,им] [союз] [сущ,им]')  # чепчик и платье
    grammar.add_macro(u'подлежащ = [местоим,им]')  # он

    grammar.add_macro(u'подлежащ,жен,ед = [сущ,им,ед,жен]')
    grammar.add_macro(u'подлежащ,муж,ед = [сущ,им,ед,муж]')

    # =====================================================================================

    grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед]')  # ты [спишь]
    grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,вин] объект,вин')  # ты [ешь кашу]
    #grammar.add_macro(u'сказуемое,2л,ед = объект,вин [гл,изъяв,2,ед,вин]')  # ты [яблоки ешь]
    grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,дат] объект,дат')  # ты [звонишь маме]
    grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,тв] объект,тв')  # ты [машешь рукой]
    grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,род] объект,род')  # ты [попил сока]

    grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед] предл_доп')  # ты пошел в школу
    #grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,вин] объект,вин предл_доп')  # ты ешь кашу из тарелки
    #grammar.add_macro(u'сказуемое,2л,ед = объект,вин [гл,изъяв,2,ед,вин] предл_доп')  # ты яблоки ешь из пакета
    #grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,дат] объект,дат предл_доп')  # ты звонишь маме из школы
    #grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,тв] объект,тв предл_доп')  # ты машешь рукой в сторону выхода
    #grammar.add_macro(u'сказуемое,2л,ед = [гл,изъяв,2,ед,род] объект,род предл_доп')  # ты пьешь сока из бутылки


    grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед]')  # кошка [спит]
    grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,вин] объект,вин')  # кошка [ест кашу]
    grammar.add_macro(u'сказуемое,3л,ед = объект,вин [гл,изъяв,3,ед,вин]')  # кошка [яблоки ест]
    grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,дат] объект,дат')  # сын [звонишь маме]
    grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,тв] объект,тв')  # папа [машем рукой]
    grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,род] объект,род')  # он [попил сока]

    grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед] предл_доп')  # Миша пошел в школу
    #grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,вин] объект,вин предл_доп')  # Миша ест кашу из тарелки
    #grammar.add_macro(u'сказуемое,3л,ед = объект,вин [гл,изъяв,3,ед,вин] предл_доп')  # Ира яблоки ест из пакета
    #grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,дат] объект,дат предл_доп')  # Вика звонит маме из школы
    #grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,тв] объект,тв предл_доп')  # Денис машет рукой в сторону выхода
    #grammar.add_macro(u'сказуемое,3л,ед = [гл,изъяв,3,ед,род] объект,род предл_доп')  # Витя пьет сока из бутылки



    grammar.add_macro(u'инф_группа = [гл,инф,несов,вин] объект,вин')  # кушать йогурт
    grammar.add_macro(u'инф_группа = [гл,инф,несов,вин] предл_доп')  # ходить в школу
    grammar.add_macro(u'инф_группа = [гл,инф,несов,вин] объект,вин предл_доп')  # кушать йогурт из тарелки
    grammar.add_macro(u'инф_группа = [гл,инф,несов,вин] предл_доп объект,вин')  # подать на него питание

    #grammar.add_macro(u'инф_группа = [нареч,модиф_глаг] [гл,инф,вин] объект,вин')  # быстро кушать йогурт
    grammar.add_macro(u'инф_группа = [гл,инф,модиф_глаг] предл_доп')  # часто ходить в школу


    grammar.add_macro(u'модальный0,2л,ед = {любишь|хочешь|можешь|предпочитаешь}')
    grammar.add_macro(u'модальный0,3л,ед = {любит|хочет|может|предпочитает}')

    grammar.add_macro(u'модальный,2л,ед = модальный0,2л,ед')  # ты можешь петь
    grammar.add_macro(u'модальный,2л,ед = не модальный0,2л,ед')  # ты не можешь петь

    grammar.add_macro(u'модальный,3л,ед = модальный0,3л,ед')  # Миша может петь
    grammar.add_macro(u'модальный,3л,ед = не модальный0,3л,ед')  # Ира не может петь

    grammar.add_macro(u'сказуемое,2л,ед = модальный,2л,ед инф_группа')  # ты [любишь кушать йогурт]
    grammar.add_macro(u'сказуемое,3л,ед = модальный,3л,ед инф_группа')  # Витя [хочет скушать йогурт]

    grammar.add_macro(u'сказуемое,прош,муж = [гл,изъяв,прош,муж] предл_доп')  # прыгал на диване
    grammar.add_macro(u'сказуемое,прош,жен = [гл,изъяв,прош,жен] предл_доп')  # прыгала на диване
    grammar.add_macro(u'сказуемое,прош,ср = [гл,изъяв,прош,ср] предл_доп')  # прыгало на диване
    grammar.add_macro(u'сказуемое,прош,мн = [гл,изъяв,прош,мн] предл_доп')  # прыгали на диване

    grammar.add_macro(u'сказуемое,прош,муж = [гл,изъяв,прош,муж,род] объект,род')  # ждал команды
    grammar.add_macro(u'сказуемое,прош,жен = [гл,изъяв,прош,жен,род] объект,род')  # ждала команды
    grammar.add_macro(u'сказуемое,прош,ср = [гл,изъяв,прош,ср,род] объект,род')  # ждало команды
    grammar.add_macro(u'сказуемое,прош,мн = [гл,изъяв,прош,мн,род] объект,род')  # ждали команды

    grammar.add_macro(u'сказуемое,прош,муж = [гл,изъяв,прош,муж,вин] объект,род')  # съел булку
    grammar.add_macro(u'сказуемое,прош,жен = [гл,изъяв,прош,жен,вин] объект,род')  # съела булку
    grammar.add_macro(u'сказуемое,прош,ср = [гл,изъяв,прош,ср,вин] объект,род')  # съело булку
    grammar.add_macro(u'сказуемое,прош,мн = [гл,изъяв,прош,мн,вин] объект,род')  # съели булку

    grammar.add_macro(u'сказуемое,прош = сказуемое,прош,муж')
    grammar.add_macro(u'сказуемое,прош = сказуемое,прош,жен')
    grammar.add_macro(u'сказуемое,прош = сказуемое,прош,ср')
    grammar.add_macro(u'сказуемое,прош = сказуемое,прош,мн')

    grammar.add_macro(u'нареч_группа = [нареч]')
    grammar.add_macro(u'нареч_группа = [нареч,модиф_нареч] [нареч]')  # совершенно спокойно
    grammar.add_macro(u'нареч_группа = [нареч] [союз] [нареч]') # выше и слева

    grammar.add_macro(u'прилаг0 = [прил,~кр]')  # злая
    grammar.add_macro(u'прилаг0 = [нареч,модиф_прил] [прил,~кр,положит]')  # очень злая
    grammar.add_macro(u'прилаг_группа = прилаг0')
    grammar.add_macro(u'прилаг_группа = прилаг0 [союз] прилаг0')  # мягкая и теплая
    # мягкая и теплая

    grammar.add_macro(u'числ_группа = [числит]')
    grammar.add_macro(u'числ_группа = [num_word]')

    # =========
    # Ответы
    # =========

    # 10 часов 51 минута
    grammar.add_rule(u'[num_word] (час.+) [num_word] (минут.+)')

    # 31 марта
    grammar.add_rule(u'[num_word] [сущ]')

    # Восемь
    # 8
    grammar.add_rule(u'числ_группа')

    # Очень злая
    grammar.add_rule(u'прилаг_группа')

    # Очень голодная кошка
    grammar.add_rule(u'подлежащ')

    # Очень любить йогурт
    grammar.add_rule(u'инф_группа')

    # Очень долго
    grammar.add_rule(u'нареч_группа')

    # На мягком диване
    grammar.add_rule(u'предл_доп')

    # в пятницу после обеда
    grammar.add_rule(u'предл_доп предл_доп')

    # Очень толстую кошку
    grammar.add_rule(u'объект,вин')

    # Очень голодной кошке
    grammar.add_rule(u'объект,дат')

    # Толстой мышкой
    grammar.add_rule(u'объект,тв')

    # Злой собаки
    grammar.add_rule(u'объект,род')

    grammar.add_rule(u'сказуемое,2л,ед')
    grammar.add_rule(u'сказуемое,3л,ед')
    grammar.add_rule(u'сказуемое,прош')

    print('Computation flow compilation...')
    grammar.compile_rules()
